/*
 * NoGray JavaScript Library v1.0
 * http://www.NoGray.com
 *
 * Copyright (c) 2009 Wesam Saif
 * http://www.nogray.com/license.php
 */
ng.Language.set_language('ar', {
	direction: 'rtl',
	
	numbers: ['٠','١','٢','٣','٤','٥','٦','٧','٨','٩'],
	
	date: {
		date_format: 'd/m/Y',
		time_format: 'h:i a',
		
		days:{
			'char':['أ','ا','ث','أ','خ','ج','س'],
			short:['أح','اث','ثل','أر','خم','جم','سب'],
			mid:['أحد','اثنين','ثلاثاء','أربعاء','خميس','جمعة','سبت'],
			'long':['الأحد','الاثنين','الثلاثاء','الأربعاء','الخميس','الجمعة','السبت']
		},
		months:{
			short:['ينا','فبر','مار','أبر','ماي','يون','يول','أغس','سبت','أكت','نوف','ديس'],
			'long':['يناير','فبراير','مارس','أبريل','مايو','يونيو','يوليو','أغسطس','سبتمبر','أكتوبر','نوفمبر','ديسمبر']
		},
		am_pm:{
			lowercase:['ص','م'],
			uppercase:['صباح','مساء']
		}	
	},
	
	yes: 'نعم',
	no: 'لا',
	
	'open': 'افتح',
	'close': 'أغلق',
	clear: 'إلغاء'
});

